void setup(){
 size(500,500); 
}
int [][] go={
  {0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0}, 
};///建立9*9的陣列
int N=0;
void mousePressed(){
   int j = (mouseX-25)/50;//因為前面我們空了50，我們取一半(為了偵測位置)，除50就會知道現在是第幾格
   int i = (mouseY-25)/50;
   go[i][j]=(N%2==0) ? 1: 2; // 如果(N%2==0) 用1，否則2
   N++;
}
void draw(){
   background(#EABB74);
   for(int i=1;i<=9;i++){
     for(int j=1;j<=9;j++){
       line( 50 , 50*i , 450 , 50*i);//橫線
       line(50*i,   50 , 50*i, 450 );//直線
     }
   }
   for(int i=0 ; i<9 ; i++){
     for( int j=0 ; j<9 ; j++){
       if(go[i][j]==1){
         fill(0);//當讀到1時畫黑棋
         ellipse( 50+j*50 , 50+i*50 , 50, 50); 
       }
       else if(go[i][j]==2){
         fill(255);
         ellipse( 50+j*50 , 50+i*50 , 50, 50);
       }///除了1,2以外的值都不畫。
     }
   }
}
