void setup() {
  size(500, 700);
}
int [][]board={
  {4, 5, 3, 2, 1, 2, 3, 5, 4},
  {0, 0, 0, 0, 0, 0, 0, 0, 0},
  {0, 6, 0, 0, 0, 0, 0, 6, 0},
  {7, 0, 7, 0, 7, 0, 7, 0, 7},
  {0, 0, 0, 0, 0, 0, 0, 0, 0},
};//將象棋個棋編碼
void draw() {
  for (int x=50; x<=450; x+=50) {
    line( x, 50, x, 250);//上排(為了楚河漢界)
    line( x, 300, x, 500);//下排
  }
  for (int y=50; y<=500; y+=50) {
    line( 50, y, 450, y); //line(x1,y1,x2,y2);
  }
  for (int i=0; i<5; i++) {///印出象棋
    for (int j=0; j<9; j++) {
      text( board[i][j], 50+j*50, 50+i*50);//左邊y,右邊x
    }
  }
}
